                    __      ______                      __                      
 /'\_/`\           /\ \  __/\__  _\                    /\ \                     
/\      \     __   \_\ \/\_\/_/\ \/ _ __    __      ___\ \ \/'\      __   _ __  
\ \ \__\ \  /'__`\ /'_` \/\ \ \ \ \/\`'__\/'__`\   /'___\ \ , <    /'__`\/\`'__\
 \ \ \_/\ \/\  __//\ \L\ \ \ \ \ \ \ \ \//\ \L\.\_/\ \__/\ \ \\`\ /\  __/\ \ \/ 
  \ \_\\ \_\ \____\ \___,_\ \_\ \ \_\ \_\\ \__/.\_\ \____\\ \_\ \_\ \____\\ \_\ 
   \/_/ \/_/\/____/\/__,_ /\/_/  \/_/\/_/ \/__/\/_/\/____/ \/_/\/_/\/____/ \/_/ 
                                                                                
                                                                                
Welcome to MediTracker, your best companion to track your medicine intake.
Let's begin tracking!

____________________________________________________________
meditracker> SUCCESS: Medicine has been added
____________________________________________________________
meditracker> SUCCESS: Medicine has been modified
____________________________________________________________
meditracker> ERROR: Insufficient quantity. Dosage Required -> 500.0, Quantity Available -> 60.0
____________________________________________________________
meditracker> SUCCESS: Medication already untaken, no changes were made
____________________________________________________________
meditracker> SUCCESS: Medicine has been deleted
____________________________________________________________
meditracker> SUCCESS: Medicine has been added
____________________________________________________________
meditracker> SUCCESS: Medication already untaken, no changes were made
____________________________________________________________
meditracker> INFO: Medication quantity decreased: 1000.0 -> 500.0
SUCCESS: Medicine has been taken
____________________________________________________________
meditracker> SUCCESS: Medication already taken, no changes were made
____________________________________________________________
meditracker> You have 1 medications listed below.
   Name                           Quantity   Expiry     Remarks                       
1. Medication A                   500.0      01/07/25   cause_dizziness                
Your list of medications has been successfully shown!
____________________________________________________________
meditracker> Name: Medication A
Quantity: 500.0
Expiry Date: 01/07/25
Remarks: cause_dizziness
Morning Dosage: 500.0
Afternoon Dosage: 250.0
Evening Dosage: 100.0
Repeat: 1
SUCCESS: Medication details has been retrieved
____________________________________________________________
meditracker> ERROR: Missing "-dM" argument
____________________________________________________________
meditracker> ERROR: Missing "-dM" argument
____________________________________________________________
meditracker> ERROR: No value found for argument "-l"
____________________________________________________________
meditracker> ERROR: Medicine can not be found. null. 
____________________________________________________________
meditracker> ERROR: Medicine can not be found. null. 
____________________________________________________________
meditracker> Name: Medication A
Quantity: 500.0
Expiry Date: 01/07/25
Remarks: cause_dizziness
Morning Dosage: 500.0
Afternoon Dosage: 250.0
Evening Dosage: 100.0
Repeat: 1
SUCCESS: Medication details has been retrieved
____________________________________________________________
meditracker> Name: Medication A
Quantity: 500.0
Expiry Date: 01/07/25
Remarks: cause_dizziness
Morning Dosage: 500.0
Afternoon Dosage: 250.0
Evening Dosage: 100.0
Repeat: 1
SUCCESS: Medication details has been retrieved
____________________________________________________________
meditracker> ERROR: You can only have one flag!
____________________________________________________________
meditracker> Thank you for using MediTracker. Hope to see you again!
