                    __      ______                      __                      
 /'\_/`\           /\ \  __/\__  _\                    /\ \                     
/\      \     __   \_\ \/\_\/_/\ \/ _ __    __      ___\ \ \/'\      __   _ __  
\ \ \__\ \  /'__`\ /'_` \/\ \ \ \ \/\`'__\/'__`\   /'___\ \ , <    /'__`\/\`'__\
 \ \ \_/\ \/\  __//\ \L\ \ \ \ \ \ \ \ \//\ \L\.\_/\ \__/\ \ \\`\ /\  __/\ \ \/ 
  \ \_\\ \_\ \____\ \___,_\ \_\ \ \_\ \_\\ \__/.\_\ \____\\ \_\ \_\ \____\\ \_\ 
   \/_/ \/_/\/____/\/__,_ /\/_/  \/_/\/_/ \/__/\/_/\/____/ \/_/\/_/\/____/ \/_/ 
                                                                                
                                                                                
Welcome to MediTracker, your best companion to track your medicine intake.
Let's begin tracking!

____________________________________________________________
meditracker> SUCCESS: Medicine has been added
____________________________________________________________
meditracker> SUCCESS: Medicine has been modified
____________________________________________________________
meditracker> ERROR: Insufficient quantity. Dosage Required -> 500.0, Quantity Available -> 60.0
____________________________________________________________
meditracker> SUCCESS: Medicine has been untaken
____________________________________________________________
meditracker> SUCCESS: Medicine has been deleted
____________________________________________________________
meditracker> SUCCESS: Medicine has been added
____________________________________________________________
meditracker> SUCCESS: Medicine has been taken
____________________________________________________________
meditracker> You have 1 medications listed below.
Format: Name | Quantity | Expiry Date | Remarks
	1. Medication_A | 500.0 | 01/07/25 | cause_dizziness
____________________________________________________________
meditracker> Name: Medication_A
Quantity: 500.0
Expiry Date: 01/07/25
Remarks: cause_dizziness
Morning Dosage: 500.0
Afternoon Dosage: 250.0
Evening Dosage: 0.0
Repeat: 1
SUCCESS: Medication details has been retrieved
____________________________________________________________
meditracker> Thank you for using MediTracker. Hope to see you again!
